src/cf/Reports/уатДействующиеПрейскуранты.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Report>
		<Properties>
			<Name>уатДействующиеПрейскуранты</Name>
		</Properties>
	</Report>
</MetaDataObject>

src/cf/Enums/уатГруппировкиТарифов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатГруппировкиТарифов</Name>
			<Comment>(уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Расстояние</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВремяРаботы</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КлассГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВесГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СтоимостьГруза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>КоличествоМест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Грузоподъемность</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемКузова</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выручка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Reports/уатДействующиеПрейскуранты/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Задает настройки размещения вариантов отчетов в панели отчетов.
// См. ВариантыОтчетовПереопределяемый.НастроитьВариантыОтчетов().
//
// Параметры:
//   Настройки - Коллекция - Используется для описания настроек отчетов и вариантов
//       см. описание к ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//   НастройкиОтчета - СтрокаДереваЗначений - Настройки размещения всех вариантов отчета.
//       См. ""Реквизиты для изменения"" функции ВариантыОтчетов.ДеревоНастроекВариантовОтчетовКонфигурации().
//
Процедура НастроитьВариантыОтчета(Настройки, НастройкиОтчета) Экспорт
	
	НастройкиВарианта = ВариантыОтчетов.ОписаниеВарианта(Настройки, НастройкиОтчета, "Действующие прейскуранты");
	НастройкиВарианта.Описание = НСтр("en='Report provides information about the current price lists for transport services.';ru='Отчет предназначен для отображения информации о действующих прейскурантах на транспортные услуги.'");
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныйПрограммныйИнтерфейс

Функция ПолучитьПериодДействияПрейскуранта(ДатаНачала, ДатаОкончания) Экспорт
	
	Возврат НСтр("en='from';ru='с'") + " " + Формат(ДатаНачала, "ДФ=dd.MM.yy") + " " + НСтр("en='till';ru='по'") + " " + Формат(ДатаОкончания, "ДФ=dd.MM.yy");
	
КонецФункции // ПолучитьПериодДействияПрейскуранта()

Функция ПолучитьСтоимость(ТарифСсылка, IDСтроки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТарифСсылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ТарифСсылка.СложныйТариф Тогда
		СтрокаСтоимости = "";
		ТЧЗначенияГруппировок = ?(ТарифСсылка.ТарифнаяСетка, ТарифСсылка.ЗначенияТарифнойСетки, ТарифСсылка.Тарифы);
		
		Для Каждого СтрокаТарифа Из ТЧЗначенияГруппировок Цикл 
			Если ТарифСсылка.ТарифнаяСетка И СтрокаТарифа.ID <> IDСтроки Тогда
				Продолжить;
			КонецЕсли;
			
			ЗнакГруппировки1 = ?(ТарифСсылка.ТарифнаяСетка, "<=", СтрокаТарифа.ЗнакГруппировки1);
			ЗнакГруппировки2 = ?(ТарифСсылка.ТарифнаяСетка, "<=", СтрокаТарифа.ЗнакГруппировки2);
			ЗнакГруппировки3 = ?(ТарифСсылка.ТарифнаяСетка, "<=", СтрокаТарифа.ЗнакГруппировки3);
			
			ПодстрокаСтоимости = "";
			Если ЗначениеЗаполнено(ЗнакГруппировки1) Тогда 
				ПодстрокаСтоимости = ПодстрокаСтоимости + ?(ПодстрокаСтоимости = "", "", " " + НСтр("en='and';ru='и'") + " ")
					+ ПолучитьПредставлениеГруппировки(ТарифСсылка.ГруппировкаТарифа1)
					+ ЗнакГруппировки1 + Формат(СтрокаТарифа.ЗначениеГруппировки1, "ЧН=0")
					+ ?(ТипЗнч(ТарифСсылка.ГруппировкаТарифа1) = Тип("СправочникСсылка.уатПараметрыВыработки"), " " + ТарифСсылка.ГруппировкаТарифа1.ЕдиницаИзмерения, "");
			КонецЕсли;
			Если ЗначениеЗаполнено(ЗнакГруппировки2) Тогда 
				ПодстрокаСтоимости = ПодстрокаСтоимости + ?(ПодстрокаСтоимости = "", "", " " + НСтр("en='and';ru='и'") + " ")
					+ ПолучитьПредставлениеГруппировки(ТарифСсылка.ГруппировкаТарифа2)
					+ ЗнакГруппировки2 + Формат(СтрокаТарифа.ЗначениеГруппировки2, "ЧН=0")
					+ ?(ТипЗнч(ТарифСсылка.ГруппировкаТарифа2) = Тип("СправочникСсылка.уатПараметрыВыработки"), " " + ТарифСсылка.ГруппировкаТарифа2.ЕдиницаИзмерения, "");
			КонецЕсли;
			Если ЗначениеЗаполнено(ЗнакГруппировки3) Тогда 
				ПодстрокаСтоимости = ПодстрокаСтоимости + ?(ПодстрокаСтоимости = "", "", " " + НСтр("en='and';ru='и'") + " ")
					+ ПолучитьПредставлениеГруппировки(ТарифСсылка.ГруппировкаТарифа3)
					+ ЗнакГруппировки3 + Формат(СтрокаТарифа.ЗначениеГруппировки3, "ЧН=0")
					+ ?(ТипЗнч(ТарифСсылка.ГруппировкаТарифа3) = Тип("СправочникСсылка.уатПараметрыВыработки"), " " + ТарифСсылка.ГруппировкаТарифа3.ЕдиницаИзмерения, "");
			КонецЕсли;
			
			//СтрокаСтоимости = СтрокаСтоимости + ?(СтрокаСтоимости = "", "", Символы.ПС) + ПодстрокаСтоимости + " - " + Строка(СтрокаТарифа.Тариф) + ";";
			СтрокаСтоимости = СтрокаСтоимости + ?(СтрокаСтоимости = "", "", Символы.ПС) + Строка(СтрокаТарифа.Тариф) + ", при " + ПодстрокаСтоимости + ";";
		КонецЦикла;
	Иначе
		Если ТарифСсылка.ТарифнаяСетка Тогда
			ТекСтрокаСетки = ТарифСсылка.СтрокиТарифнойСетки.Найти(IDСтроки, "ID");
			Если ТекСтрокаСетки <> Неопределено Тогда
				СтрокаСтоимости = "" + Строка(ТекСтрокаСетки.Тариф);
			КонецЕсли;
		Иначе
			СтрокаСтоимости = "" + Строка(ТарифСсылка.Тариф);
		КонецЕсли;
	КонецЕсли;
	
	//Если ТарифСсылка.ТарифнаяСетка Тогда 
	//	СтрокаСтоимости = НСтр("en='Determined by tariff scale';ru='Определяется по тарифной сетке'");
	//	
	//ИначеЕсли ТарифСсылка.СложныйТариф Тогда 
	//	Для Каждого СтрокаТарифа Из ТарифСсылка.Тарифы Цикл 
	//		ПодстрокаСтоимости = "";
	//		Если ЗначениеЗаполнено(СтрокаТарифа.ЗнакГруппировки1) Тогда 
	//			ПодстрокаСтоимости = ПодстрокаСтоимости + ?(ПодстрокаСтоимости = "", "", " " + НСтр("en='and';ru='и'") + " ") + ПолучитьПредставлениеГруппировки(ТарифСсылка.ГруппировкаТарифа1) + СтрокаТарифа.ЗнакГруппировки1 + Формат(СтрокаТарифа.ЗначениеГруппировки1, "ЧН=0");
	//		КонецЕсли;
	//		Если ЗначениеЗаполнено(СтрокаТарифа.ЗнакГруппировки2) Тогда 
	//			ПодстрокаСтоимости = ПодстрокаСтоимости + ?(ПодстрокаСтоимости = "", "", " " + НСтр("en='and';ru='и'") + " ") + ПолучитьПредставлениеГруппировки(ТарифСсылка.ГруппировкаТарифа2) + СтрокаТарифа.ЗнакГруппировки2 + Формат(СтрокаТарифа.ЗначениеГруппировки2, "ЧН=0");
	//		КонецЕсли;
	//		Если ЗначениеЗаполнено(СтрокаТарифа.ЗнакГруппировки3) Тогда 
	//			ПодстрокаСтоимости = ПодстрокаСтоимости + ?(ПодстрокаСтоимости = "", "", " " + НСтр("en='and';ru='и'") + " ") + ПолучитьПредставлениеГруппировки(ТарифСсылка.ГруппировкаТарифа3) + СтрокаТарифа.ЗнакГруппировки3 + Формат(СтрокаТарифа.ЗначениеГруппировки3, "ЧН=0");
	//		КонецЕсли;
	//		
	//		СтрокаСтоимости = СтрокаСтоимости + ?(СтрокаСтоимости = "", "", Символы.ПС) + ПодстрокаСтоимости + " - " + Строка(СтрокаТарифа.Тариф) + ";";
	//	КонецЦикла;
	//	
	//Иначе 
	//	СтрокаСтоимости = "" + Строка(ТарифСсылка.Тариф);
	//КонецЕсли;
	
	Возврат СтрокаСтоимости;
	
КонецФункции // ПолучитьСтоимость()

Функция ПолучитьМинимальнуюВыработку(ТарифСсылка) Экспорт
	
	Если НЕ ЗначениеЗаполнено(ТарифСсылка) Тогда
		Возврат "";
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТарифСсылка.МинимальнаяВыработка) Тогда 
		Возврат Строка(ТарифСсылка.МинимальнаяВыработка) + " " + Строка(ТарифСсылка.ПараметрВыработки.ЕдиницаИзмерения);
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции // ПолучитьМинимальнуюВыработку()

Функция ПолучитьОбластьДействия(ОбластьДействия) Экспорт
	мсвРез = Новый Массив;
	ТекОбласть = "";
	флСкобки = 0;
	Для Сч = 1 По СтрДлина(ОбластьДействия) Цикл
		ТекСимвол = Сред(ОбластьДействия, Сч, 1);
		
		Если ТекСимвол = "(" Тогда
			флСкобки = флСкобки + 1;
		ИначеЕсли ТекСимвол = ")" Тогда
			флСкобки = флСкобки - 1;
		КонецЕсли;
					
		Если ТекСимвол = ";" И флСкобки = 0 Тогда
			мсвРез.Добавить(ТекОбласть);
			ТекОбласть = "";
		Иначе
			ТекОбласть = ТекОбласть + ТекСимвол;
		КонецЕсли;
	КонецЦикла;
	Если ЗначениеЗаполнено(ТекОбласть) Тогда
		мсвРез.Добавить(ТекОбласть);
	КонецЕсли;
	
	Рез = "";
	Для Каждого ТекОбласть Из мсвРез Цикл
		Рез = Рез + СокрЛП(ТекОбласть) + ";" + Символы.ПС;
	КонецЦикла;
	Если ЗначениеЗаполнено(Рез) Тогда
		Рез = Лев(Рез, СтрДлина(Рез)-2);
	КонецЕсли;
	
	Возврат Рез;
КонецФункции

#КонецОбласти


#Область ОбработчикиСобытий

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	уатЗащищенныеФункцииСервер.уатОтчетОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка);
	
КонецПроцедуры

#КонецОбласти


#Область СлужебныеПроцедурыИФункции

Функция ПолучитьПредставлениеГруппировки(Группировка)
	
	Если Группировка = Перечисления.уатГруппировкиТарифов.ОбъемГруза Тогда 
		Возврат "V";
	ИначеЕсли Группировка = Перечисления.уатГруппировкиТарифов.ВесГруза Тогда 
		Возврат "W";
	ИначеЕсли Группировка = Перечисления.уатГруппировкиТарифов.КоличествоМест Тогда 
		Возврат "N";
	ИначеЕсли Группировка = Перечисления.уатГруппировкиТарифов.СтоимостьГруза Тогда 
		Возврат "P";
	ИначеЕсли Группировка = Перечисления.уатГруппировкиТарифов.Расстояние Тогда 
		Возврат "R";
	ИначеЕсли Группировка = Перечисления.уатГруппировкиТарифов.ВремяРаботы Тогда 
		Возврат "T";
	Иначе 
		Возврат "";
	КонецЕсли;
	
КонецФункции // ПолучитьПредставлениеГруппировки()

#КонецОбласти


#КонецЕсли
